# 연습문제 8-1
# 유형: '체스말'은 다음 키를 가지는 사전이다.
#     * 'x': 말이 놓인 x축의 위치 (정수)
#     * 'y': 말이 놓인 y축의 위치 (정수)
#     * 'color': 말의 색 (문자열, 'black' 또는 'white')
#     * 'role': 말의 역할 (문자열)
체스말1 = {'x': 'A', 'y': '8', 'color': 'black', 'role': '룩'}
체스말2 = {'x': 'E', 'y': '1', 'color': 'white', 'role': '킹'}

# 유형: '바둑돌'은 다음 키를 가지는 사전이다.
#     * 'x': 돌이 놓인 x축의 위치 (정수)
#     * 'y': 돌이 놓인 y축의 위치 (정수)
#     * 'order': 돌이 놓인 수 (정수)
#     * 'color': 돌의 색 (문자열, '흑' 또는 '백')
바둑돌1 = {'x': 8, 'y': 14, 'order': 83, 'color': '흑'}
바둑돌2 = {'x': 12, 'y': 3, 'order': 84, 'color': '백'}
