# 연습문제 7-2
weather_table = [
    {'날짜': '9월 1일', '지역': '경기', '날씨': '맑음', '기온': 27.2, '습도': 0.4, '강수확률': 0.1},
    {'날짜': '9월 1일', '지역': '강원', '날씨': '맑음', '기온': 23.6, '습도': 0.6, '강수확률': 0.1},
    {'날짜': '9월 1일', '지역': '충청', '날씨': '맑음', '기온': 24.4, '습도': 0.35, '강수확률': 0.1},
    {'날짜': '9월 1일', '지역': '경상', '날씨': '맑음', '기온': 26, '습도': 0.35, '강수확률': 0.1},
    {'날짜': '9월 1일', '지역': '전라', '날씨': '맑음', '기온': 27, '습도': 0.4, '강수확률': 0},
    {'날짜': '9월 1일', '지역': '제주', '날씨': '구름 조금', '기온': 26.4, '습도': 0.45, '강수확률': 0.1},
]
